; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x7-y7-t4-k3333-l3333-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f 
        f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f 
        shape0 shape1 shape2 shape3 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
        key2-0 key2-1 key2-2 
        key3-0 key3-1 key3-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f6-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f6-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f6-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f6-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f6-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(place f6-5f)
(place f0-6f)
(place f1-6f)
(place f2-6f)
(place f3-6f)
(place f4-6f)
(place f5-6f)
(place f6-6f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(key key3-0)
(key-shape key3-0 shape3)
(key key3-1)
(key-shape key3-1 shape3)
(key key3-2)
(key-shape key3-2 shape3)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f5-0f f6-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f5-1f f6-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f5-2f f6-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f5-3f f6-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f5-4f f6-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f5-5f f6-5f)
(conn f0-6f f1-6f)
(conn f1-6f f2-6f)
(conn f2-6f f3-6f)
(conn f3-6f f4-6f)
(conn f4-6f f5-6f)
(conn f5-6f f6-6f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f6-0f f6-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f6-1f f6-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f6-2f f6-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f6-3f f6-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f6-4f f6-5f)
(conn f0-5f f0-6f)
(conn f1-5f f1-6f)
(conn f2-5f f2-6f)
(conn f3-5f f3-6f)
(conn f4-5f f4-6f)
(conn f5-5f f5-6f)
(conn f6-5f f6-6f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f6-0f f5-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f6-1f f5-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f6-2f f5-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f6-3f f5-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f6-4f f5-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f6-5f f5-5f)
(conn f1-6f f0-6f)
(conn f2-6f f1-6f)
(conn f3-6f f2-6f)
(conn f4-6f f3-6f)
(conn f5-6f f4-6f)
(conn f6-6f f5-6f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f6-1f f6-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f6-2f f6-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f6-3f f6-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f6-4f f6-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(conn f6-5f f6-4f)
(conn f0-6f f0-5f)
(conn f1-6f f1-5f)
(conn f2-6f f2-5f)
(conn f3-6f f3-5f)
(conn f4-6f f4-5f)
(conn f5-6f f5-5f)
(conn f6-6f f6-5f)
(open f0-0f)
(open f1-0f)
(open f2-0f)
(open f3-0f)
(open f4-0f)
(open f5-0f)
(open f6-0f)
(open f0-1f)
(open f1-1f)
(open f3-1f)
(open f4-1f)
(open f0-2f)
(open f1-2f)
(open f2-2f)
(open f3-2f)
(open f4-2f)
(open f6-2f)
(open f0-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f5-3f)
(open f6-3f)
(open f0-4f)
(open f1-4f)
(open f2-4f)
(open f3-4f)
(open f6-4f)
(open f1-5f)
(open f3-5f)
(open f4-5f)
(open f5-5f)
(open f6-5f)
(open f1-6f)
(open f3-6f)
(open f5-6f)
(open f6-6f)
(locked f0-6f)
(lock-shape f0-6f shape0)
(locked f5-4f)
(lock-shape f5-4f shape0)
(locked f6-1f)
(lock-shape f6-1f shape0)
(locked f2-5f)
(lock-shape f2-5f shape1)
(locked f5-1f)
(lock-shape f5-1f shape1)
(locked f2-6f)
(lock-shape f2-6f shape1)
(locked f0-5f)
(lock-shape f0-5f shape2)
(locked f5-2f)
(lock-shape f5-2f shape2)
(locked f4-6f)
(lock-shape f4-6f shape2)
(locked f2-1f)
(lock-shape f2-1f shape3)
(locked f4-4f)
(lock-shape f4-4f shape3)
(locked f1-3f)
(lock-shape f1-3f shape3)
(at key0-0 f0-6f)
(at key0-1 f6-5f)
(at key0-2 f5-2f)
(at key1-0 f2-3f)
(at key1-1 f4-2f)
(at key1-2 f6-2f)
(at key2-0 f2-6f)
(at key2-1 f1-0f)
(at key2-2 f2-5f)
(at key3-0 f3-0f)
(at key3-1 f4-5f)
(at key3-2 f6-4f)
(at-robot f0-2f)
)
(:goal
(and
(at key0-2 f6-0f)
(at key2-2 f5-2f)
)
)
)

; plan
1. (move f0-2f f1-2f)
   deleted: (at-robot f0-2f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
2. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 0 of 2
3. (move f1-1f f1-0f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-0f)
   goals met: 0 of 2
4. (pickup f1-0f key2-1)
   deleted: (at key2-1 f1-0f) (arm-empty)
   added: (holding key2-1)
   goals met: 0 of 2
5. (move f1-0f f1-1f)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 0 of 2
6. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
7. (move f1-2f f2-2f)
   deleted: (at-robot f1-2f)
   added: (at-robot f2-2f)
   goals met: 0 of 2
8. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 0 of 2
9. (move f3-2f f4-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f4-2f)
   goals met: 0 of 2
10. (unlock f4-2f f5-2f key2-1 shape2)
   deleted: (locked f5-2f)
   added: (open f5-2f)
   goals met: 0 of 2
11. (pickup-and-loose f4-2f key1-1 key2-1)
   deleted: (holding key2-1) (at key1-1 f4-2f)
   added: (holding key1-1) (at key2-1 f4-2f)
   goals met: 0 of 2
12. (move f4-2f f5-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f5-2f)
   goals met: 0 of 2
13. (unlock f5-2f f5-1f key1-1 shape1)
   deleted: (locked f5-1f)
   added: (open f5-1f)
   goals met: 0 of 2
14. (pickup-and-loose f5-2f key0-2 key1-1)
   deleted: (holding key1-1) (at key0-2 f5-2f)
   added: (holding key0-2) (at key1-1 f5-2f)
   goals met: 0 of 2
15. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 0 of 2
16. (move f5-1f f5-0f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-0f)
   goals met: 0 of 2
17. (move f5-0f f6-0f)
   deleted: (at-robot f5-0f)
   added: (at-robot f6-0f)
   goals met: 0 of 2
18. (putdown f6-0f key0-2)
   deleted: (holding key0-2)
   added: (arm-empty) (at key0-2 f6-0f)
   goals met: 1 of 2
19. (move f6-0f f5-0f)
   deleted: (at-robot f6-0f)
   added: (at-robot f5-0f)
   goals met: 1 of 2
20. (move f5-0f f5-1f)
   deleted: (at-robot f5-0f)
   added: (at-robot f5-1f)
   goals met: 1 of 2
21. (move f5-1f f5-2f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-2f)
   goals met: 1 of 2
22. (pickup f5-2f key1-1)
   deleted: (at key1-1 f5-2f) (arm-empty)
   added: (holding key1-1)
   goals met: 1 of 2
23. (move f5-2f f4-2f)
   deleted: (at-robot f5-2f)
   added: (at-robot f4-2f)
   goals met: 1 of 2
24. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 1 of 2
25. (move f4-3f f3-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f3-3f)
   goals met: 1 of 2
26. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 1 of 2
27. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 1 of 2
28. (unlock f2-4f f2-5f key1-1 shape1)
   deleted: (locked f2-5f)
   added: (open f2-5f)
   goals met: 1 of 2
29. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 1 of 2
30. (pickup-and-loose f2-5f key2-2 key1-1)
   deleted: (holding key1-1) (at key2-2 f2-5f)
   added: (holding key2-2) (at key1-1 f2-5f)
   goals met: 1 of 2
31. (move f2-5f f2-4f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 1 of 2
32. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 1 of 2
33. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 1 of 2
34. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 1 of 2
35. (move f4-3f f5-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f5-3f)
   goals met: 1 of 2
36. (move f5-3f f5-2f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-2f)
   goals met: 1 of 2
37. (putdown f5-2f key2-2)
   deleted: (holding key2-2)
   added: (arm-empty) (at key2-2 f5-2f)
   goals met: 2 of 2
